In [1]:
import pandas as pd

import numpy as np

In [2]:
employees = {
    "Name": ["Ahmed", "Sara", None, "Mohamed", "Fatima", "Ali"],
    "Department": ["IT", "HR", "IT", "Finance", None, "IT"],
    "Salary": [5000, 4500, 6000, None, 4000, 5500],
    "Age": [28, 35, 24, 45, 30, None],
    "Joining_Date": ["2020-03-15", "2019-07-20", "2022-01-10", 
                     "2018-05-25", "2021-08-30", "2020-11-15"]
}
df = pd.DataFrame(employees)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          5 non-null      object
 1   Department    5 non-null      object
 2   Salary        5 non-null      float64
 3   Age           5 non-null      float64
 4   Joining_Date  6 non-null      object
dtypes: float64(2), object(3)
memory usage: 368.0+ bytes

In [4]:
df.head(3)

    Name Department  Salary   Age Joining_Date
0  Ahmed         IT  5000.0  28.0   2020-03-15
1   Sara         HR  4500.0  35.0   2019-07-20
2   None         IT  6000.0  24.0   2022-01-10

In [5]:
df.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Name,5,5,Ahmed,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Department,5,3,IT,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Salary,5.0,NaN,NaN,NaN,5000.0,790.569415,4000.0,4500.0,5000.0,5500.0,6000.0
Age,5.0,NaN,NaN,NaN,32.4,8.080842,24.0,28.0,30.0,35.0,45.0
Joining_Date,6,6,2020-03-15,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df.isnull().sum()

Name            1
Department      1
Salary          1
Age             1
Joining_Date    0
dtype: int64

In [9]:
df['Department'].fillna('Unknown',inplace=True)

In [10]:
df

      Name Department  Salary   Age Joining_Date
0    Ahmed         IT  5000.0  28.0   2020-03-15
1     Sara         HR  4500.0  35.0   2019-07-20
2     None         IT  6000.0  24.0   2022-01-10
3  Mohamed    Finance     NaN  45.0   2018-05-25
4   Fatima    Unknown  4000.0  30.0   2021-08-30
5      Ali         IT  5500.0   NaN   2020-11-15

In [14]:
df['Salary'].fillna(df['Salary'].mean(), inplace=True)

df

      Name Department  Salary   Age Joining_Date
0    Ahmed         IT  5000.0  28.0   2020-03-15
1     Sara         HR  4500.0  35.0   2019-07-20
2     None         IT  6000.0  24.0   2022-01-10
3  Mohamed    Finance  5000.0  45.0   2018-05-25
4   Fatima    Unknown  4000.0  30.0   2021-08-30
5      Ali         IT  5500.0   NaN   2020-11-15

In [15]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

/tmp/ipykernel_93605/694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [16]:
df

      Name Department  Salary   Age Joining_Date
0    Ahmed         IT  5000.0  28.0   2020-03-15
1     Sara         HR  4500.0  35.0   2019-07-20
2     None         IT  6000.0  24.0   2022-01-10
3  Mohamed    Finance  5000.0  45.0   2018-05-25
4   Fatima    Unknown  4000.0  30.0   2021-08-30
5      Ali         IT  5500.0  32.4   2020-11-15

In [17]:
df[['Name','Salary']]

      Name  Salary
0    Ahmed  5000.0
1     Sara  4500.0
2     None  6000.0
3  Mohamed  5000.0
4   Fatima  4000.0
5      Ali  5500.0

In [18]:
df[df['Salary']>5000]

   Name Department  Salary   Age Joining_Date
2  None         IT  6000.0  24.0   2022-01-10
5   Ali         IT  5500.0  32.4   2020-11-15

In [19]:
df[(df['Department']=='IT') & (df['Age'] < 30)]

    Name Department  Salary   Age Joining_Date
0  Ahmed         IT  5000.0  28.0   2020-03-15
2   None         IT  6000.0  24.0   2022-01-10

In [21]:
df[(df['Department']=='HR') | (df['Department'] == 'Finance')]

      Name Department  Salary   Age Joining_Date
1     Sara         HR  4500.0  35.0   2019-07-20
3  Mohamed    Finance  5000.0  45.0   2018-05-25

In [22]:
df['Bonus'] = df['Salary'] * .2 
df['Tax']  = df['Salary'] * .1
df['Net_Salary'] = df['Salary'] + df['Bonus'] - df['Tax']

In [23]:
df

      Name Department  Salary   Age Joining_Date   Bonus    Tax  Net_Salary
0    Ahmed         IT  5000.0  28.0   2020-03-15  1000.0  500.0      5500.0
1     Sara         HR  4500.0  35.0   2019-07-20   900.0  450.0      4950.0
2     None         IT  6000.0  24.0   2022-01-10  1200.0  600.0      6600.0
3  Mohamed    Finance  5000.0  45.0   2018-05-25  1000.0  500.0      5500.0
4   Fatima    Unknown  4000.0  30.0   2021-08-30   800.0  400.0      4400.0
5      Ali         IT  5500.0  32.4   2020-11-15  1100.0  550.0      6050.0

In [25]:
def Salary_Category(x):
    if x < 4500:
        return "Low"
    elif x <= 5500:
        return "Medium"
    else:
        return "High"
    

df['Salary_Category'] = df['Salary'].apply(Salary_Category)


df

,Name,Department,Salary,Age,Joining_Date,Bonus,Tax,Net_Salary,Salary_Category
0,Ahmed,IT,5000.0,28.0,2020-03-15,1000.0,500.0,5500.0,Medium
1,Sara,HR,4500.0,35.0,2019-07-20,900.0,450.0,4950.0,Medium
2,None,IT,6000.0,24.0,2022-01-10,1200.0,600.0,6600.0,High
3,Mohamed,Finance,5000.0,45.0,2018-05-25,1000.0,500.0,5500.0,Medium
4,Fatima,Unknown,4000.0,30.0,2021-08-30,800.0,400.0,4400.0,Low
5,Ali,IT,5500.0,32.4,2020-11-15,1100.0,550.0,6050.0,Medium

In [27]:
df.groupby('Department')['Salary'].mean()

Department
Finance    5000.0
HR         4500.0
IT         5500.0
Unknown    4000.0
Name: Salary, dtype: float64

In [28]:
df.groupby('Department')['Age'].max()

Department
Finance    45.0
HR         35.0
IT         32.4
Unknown    30.0
Name: Age, dtype: float64

In [30]:
sorted_data = df.sort_values(['Salary'] , ascending=False)
sorted_data

,Name,Department,Salary,Age,Joining_Date,Bonus,Tax,Net_Salary,Salary_Category
2,None,IT,6000.0,24.0,2022-01-10,1200.0,600.0,6600.0,High
5,Ali,IT,5500.0,32.4,2020-11-15,1100.0,550.0,6050.0,Medium
3,Mohamed,Finance,5000.0,45.0,2018-05-25,1000.0,500.0,5500.0,Medium
0,Ahmed,IT,5000.0,28.0,2020-03-15,1000.0,500.0,5500.0,Medium
1,Sara,HR,4500.0,35.0,2019-07-20,900.0,450.0,4950.0,Medium
4,Fatima,Unknown,4000.0,30.0,2021-08-30,800.0,400.0,4400.0,Low

In [31]:
sorted_data = df.sort_values(['Department','Age'] , ascending=[True,False])
sorted_data

,Name,Department,Salary,Age,Joining_Date,Bonus,Tax,Net_Salary,Salary_Category
3,Mohamed,Finance,5000.0,45.0,2018-05-25,1000.0,500.0,5500.0,Medium
1,Sara,HR,4500.0,35.0,2019-07-20,900.0,450.0,4950.0,Medium
5,Ali,IT,5500.0,32.4,2020-11-15,1100.0,550.0,6050.0,Medium
0,Ahmed,IT,5000.0,28.0,2020-03-15,1000.0,500.0,5500.0,Medium
2,None,IT,6000.0,24.0,2022-01-10,1200.0,600.0,6600.0,High
4,Fatima,Unknown,4000.0,30.0,2021-08-30,800.0,400.0,4400.0,Low

In [33]:
pd.to_datetime(df['Joining_Date'])

0   2020-03-15
1   2019-07-20
2   2022-01-10
3   2018-05-25
4   2021-08-30
5   2020-11-15
Name: Joining_Date, dtype: datetime64[ns]

In [34]:
df[df['Joining_Date'] >  "2020-01-01" ]

,Name,Department,Salary,Age,Joining_Date,Bonus,Tax,Net_Salary,Salary_Category
0,Ahmed,IT,5000.0,28.0,2020-03-15,1000.0,500.0,5500.0,Medium
2,None,IT,6000.0,24.0,2022-01-10,1200.0,600.0,6600.0,High
4,Fatima,Unknown,4000.0,30.0,2021-08-30,800.0,400.0,4400.0,Low
5,Ali,IT,5500.0,32.4,2020-11-15,1100.0,550.0,6050.0,Medium

In [35]:
df.to_csv("final_employees.csv",index=0)